{"architecture":{"class_name":"Functional","config":{"name":"model","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,9,3,4],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.5,"noise_shape":null,"seed":null},"name":"dropout","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"reshape","trainable":true,"dtype":"float32","target_shape":[-1,12]},"name":"reshape","inbound_nodes":[[["dropout",0,0,{}]]]},{"class_name":"Permute","config":{"name":"permute","trainable":true,"dtype":"float32","dims":[2,1]},"name":"permute","inbound_nodes":[[["reshape",0,0,{}]]]},{"class_name":"LSTM","config":{"name":"lstm","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":9,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":4},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":5},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":6},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2},"name":"lstm","inbound_nodes":[[["permute",0,0,{}]]]},{"class_name":"LSTM","config":{"name":"lstm_1","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":9,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":9},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":10},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":11},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2},"name":"lstm_1","inbound_nodes":[[["lstm",0,0,{}]]]},{"class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":9,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":14},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":15},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":16},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2},"name":"lstm_2","inbound_nodes":[[["lstm_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":7,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["lstm_2",0,0,{}]]]},{"class_name":"Permute","config":{"name":"permute_1","trainable":true,"dtype":"float32","dims":[2,1]},"name":"permute_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"reshape_1","trainable":true,"dtype":"float32","target_shape":[-1,3,4]},"name":"reshape_1","inbound_nodes":[[["permute_1",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["reshape_1",0,0]]},"keras_version":"2.10.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[9,3,4]],"output_shapes":[[7,3,4]],"tests":[{"inputs":[{"shape":[9,3,4],"values":["kaUZP6p9HL8NY7y/hLTTvvbVqz96wUi/4iSCPkZBBL9zWO+/3JU6QGVPjT6UPq89vRyhvoxsQr9TWws/ekB8vzX3Nz2ALRfAaiG1vzneGb/MHYQ9+4vKPs3Dbr+NmTC/84nJPzTdwD4tbS2/jmm7P+XCBz8aCCc/5aO/P5GEbz+V9FQ/3A8EPtVSLb/8/w+/T8+kP1NOvD8w4d0/jlPDv8k/xD7YoN49tUd1Pv5jb78Tdgm6/K0OPskro7/RTlE+IOHdPwhpPj902J++vVuzPrYda7+erJ0+fbtbv4J9vL8l14Q+aKXKP7HbWj+vEE09UN4dvwaVjD9bx94/hWqnvy2P6L0fHVo/efOVPuUU3D+GvO8/VWCTPQ2YKr+Fs3E+qlynP94m1r7nZoq/29tQP8Z2bb+hBgNA0SMbPoYjfrzwPYO+C2nMPknolz/8mo+9KwORPzxGRr/YcwI9vqRXv9EJ+r6Urcm/ZziLvocDxz8kANM/fujYPjXgAT+rjMK/7+mRv5CuyL8ycxM/Cd+ZP+TINz4JCWY+L5dpvrGyo7920wVAi25aPqoshj39qYA/"]}],"outputs":[{"shape":[7,3,4],"values":["Pgt6Pop/9D0zJg++vCiBvZPbdL1RaA0/G93ZvrFqp7weBie+W4JdvuxUr74du7E9RGZgP3AYXryQJRq8GCuLPPo7ij2qA0A/Kox7PWKwJL9aDfc92hGPvsbrWD/QlZG9ZHNgP/SY1Txg91y8MEh/POB5db1nOUc/ohc+PtYUHL/COEU+FGWlvipbVT/wQCa8fyASP+x40b6wHCK/+K7YvdQhCz/QMtE9zeTAPt6ARb6EtCW++xohv1xOVT8WxgK+PgMAP/3GkT4mXAg/KLdEPYyLAL990ng+uAfxPoLKLL6g34E80aYSvz7CQT8GQMg9AmtjP+AZjj2Ikyg+2Mu4PY5VZT5J/vE+dvEUvwB89r7EckO+ZpnxPvNgID9o+cy9kWhdP56wLL7BN4u+ZI+LPaV3g74gyQQ/ppsPvxX6z76GLUQ+yp3/PniQGD/4gW09"]}]}],"trainable_params":{"lstm":{"weights":["7FkKPv/Xgz87dbS+vRs0v68FHEC55Gy+fQWJP0HV5z0ye/C+1wjVPUprJj8gpiLADURzQF+gOD+Ov3g+O3UiwSSZSb5vAqu7+EIOQbZ8KT1oE0K9gC05vs+k+bwY0ZU9ND00PuXpDj2hvaW9jK1evMlKsj219V8+P/gDvl53UT/DAqg7kJk5vm3riDxNBjK9bNVdPtlWrL63Nhs+Pvthv+WJuD5a4p6+4PAOP7x5D0HMCzy/pqhdvbN3UEDqJRQ/gKPovp9auD9MAcq8odDhPIFaRkC3WRO9kQxOPVUPTTw5U329ofNHvLs5yb8jL3Q+8RI+Prukjb8xXUo+5XS/vhI7IT6eaLw836YePvz4Xj798Te+CPHYPlLeUjt0ms69qWPYP++I5Lzpm6e/4EfYvsWc4L3beC6+M/TXP53yIj6HbVM+4NQ7QHNbZL+VxQM+/FgRv+iDLz+FQl8+TndEvdn+h71swnC7TpetP62Cwr0ECChAEDSOPlLHR73/fc496SGWPka1Yz0Sszy9qRnDvJmlxT2Oqd+9Eou1PR6PAT9rE9a97HKcv5UJCj5xm0a9YpsIPh7mhj/o4I2+/xUuv2tKEUBjT8m+Wn+TP2T34D3797i+Z/+5vgdDUT8A+BfAq9pRQCFLDj9NCrw9GZEfwaSMLL729uO82r0PQXTpVj1F2S+9f6YtvswYM7yeSgM+hyonPryydDxawiS9m87uvAnVvz2d/kM+jVrtvb8nQT/gHRu9DHsfvkaaGjx5kbW8IndcPqfDCb9d0Y69qF9Ev7p2Ej9tfra+aQFTPxN0kD5IQjm/N46OPkjVZEDIhBA/siTTvnfx0T8Iz6a9z/8PPSajO8CPf8Q8h98EvF9SO70vkpy98v8KvdVPzr/KBYQ+y8QTPujZFUCaNNE9GO7DvnIlGD4xLY09wl2WPkkMqD5hjoi9JxRcP6BHG8A9AIK9bNvTP6ayOL2NC62/bzzVvgxylb1dpgu+YiTVP+1dCT46R0s+kgtFQHe3fL9/ucY8","LPcIv4grGz/dMKk9Q1R5vcmIjL1Egwq7bGywP7Ll3LzBuihAT/yNPlNxSL0gmcw9l3ePPuh3hj1VyYS9H0IKvMNtxD2F88+9sZx6PSKzuj5zG7a9Nz+cv6QqFT4dTYO94ZymPWPCPD8tDIC+Rzamv6hcbUAOswC+xgKDPwsCCD5U/cS+ElmbPncrST+XNATALbOgQEtfQD9/UME7w7Y5wcLcxry365C77XIwQZZyED714dw7ye54vp5ZEbxfOCY/kF0OPosNxzy5PZ69Q8QFvczm0T1Zf7Q9oOXPvbYtLj+6JIe8szSZvp2lgDwG8z29wFoQPpRuwD1jyjm+sutlv0I8ZT9uR9y/G/BcP5AVXMDsKmW/co5YPw5tnEC7S/88VxwFPg2HFED6+4Y/IpXVvP7xyb82QTG96NTjveonb7wOWZu9JR+nvYyhE8A9zt0+3oKFPk7CWT4b+dE+3RBGv8mEgT4xAwI9g/2IPYzAQD77tj++h+IfP0SZ+UDJyy++E9XrPxxGhT6SPVy/nOnqvj9jLL7UM2y+ldulv6tUYj6sUMbAfrZXQL3Glr/Dsg0/At89vw5VvD7yFpu/TiG/PS4P6T3uMKnAuOL+P5WYq73+aVdAbR/KPnRdhT1McIs+KIwAP0dLDD2kNY6+l3a6vQY/WD2Z2Cq+uhS0vcWhEj/Sbdm8Rk5EQUlCAD79v/8+"],"recurrent_weights":["suXIPv/L2T9+r26/Uy4NQHMShz4dSLK/uHQKv0YrN7zKxf8/W58XPT06gL73ZTk+y5fjPx6Bnz9CP7Q9+A+qv1xKy71hSS6/OOi3vRa7KUAtaK0+LSq6vDppmT3rjM6/9FNzvYEzMDohPk2/wgn5PzcdZD+FoTi+PM/OPwi5hD4Sgao/abdqvxRVETx6tD6/VAiYPSz0O8CZSmS/ugRrPluEAsD034s/SlldQKbChr82UMM+xnObwJmrdL48VQi+nWXBP3/qZsBKz5dArAVCv7zkWr7yi/E/oNYnvzYshEAes8A92Hokv9vA0b0VDXU/T00Tv2DQRb5h8WQ+KytNQJTEIMAsEFw8mHFDvxJFcEAw1Kk9yrVxwJR/fr/1csw/RZXGv0rupruAYxtAMJ3QvRteqj/KQgDAbfv2P4/MJT8tW3hANtQ8wEHNXr8SnJK+iogHwMTbSj9eWgLABMx+vwYZ7z717ls/YjIXP1lMEz6+v2O/w6g9v/8FYT0msak/QE0kPl2YLz54MMU/cU83wAm6jz4Mc10/dLeQP3CLdb8Qf/O/CnjHPzOlDz/aaA/AOH8vwKhwi79yWRVA8g0jPzWQmL7WeLM/43UOQNdRRb+moIFALVfevpT4osA385A/Kma7wOvOgsDFJOLA1MZIQNa4DL8Xn8K/ifH3Po+vob6hx6M/dYiKP5KuqzzDTkg/97gPP6YvRr1mmI1AJNozwAHLHz91xBC+NwzsPsSJi0DuwLC/zvGlPxd0J79NCmU/wszBPTltTr+t1+G91PN8v6QXZz8iksk/R5SnP60pDL/aE+q/XG/uvykX2j5gUba+JGWVP8E07j9TcC2+IAy3PuOoKD5nNsI+5bAEvs21gz9rfcW+0mnRvZTMEj5TyQ1AviCovgApDb52yUC/Q3jhv0OLs78QzbM+fyb2P+/0yr3bUP2/q9U2P3sP+b5UPyQ/qbmPv49Dyr97XDnAgPGQQLR9E0Apt95AFFr4PiYNab+4qLPAytaMv+qhPj/4O9Q/","mZDmvvKAL0DKTB1AvwBWP0RjH0BCbi+/Ns5mvpyWLcGMFK29VbsaP6ZmAD6n4kI9hkQ6vulEJr/hVOzAguJ/QGCoID/4vFM/wfdavtB7DsD/Ty/A4mTHvywYgL881Ja/NuwwP72+2r7MRBxAmMcRwOwblb+WbvK/wCbOv69zdz8GcwxAvMgbv8MrkD/TRB+/hXhKwO3j27/rMQO/9GzYv8wU0b8iJ+k+c1kTPkGl/UCOq7e+k3MavrC7uD1XGe4/JB/CvghBAT9XEkBAcIjawC8ggD+esei+fnmEP+WtGTyZ3ew+XFY8wLxqmD+63wRAK3J/vyu+9r/Wmk++6ZUZQBvGAkC+PQE/NMuXvzLosb3F5URA/8y/Pop1rb7C38++M/LovwDdPUAXqZU/3qInv+JPFkAKEtw+CCD6vJ0viED/se6+iVMPvS93ij64JBRA+fmUvuCPdb+G7vI/LpHFP6KQDr7W5bM+YoPDQF+Fhb/fKj+/NCzuP/oO1zxcHza/e0IEviCvk8AH8Zc/mGrXvERyJUASxHRAg0Sev14Ko7+yOLxAUFsRPlSsab/J/6s/+8dNv4a0dsA/eBTAAD2dvyV6DUA3RTA/H3++vrJiH0FahRi/uGEAwLBpVb2/oSzAS6k1v3hkKb/VZBZAAo1qQMyzib93oA6/FFxPwIMvE0DJlPy945wMwBvKWr/pKk6/"],"bias":["dXlKP67HxkBTdgO9d6MNv+GZA0AHkoi/UWETQCWutUAUQOS9ct6Vv2miTz/OkhO/o0ArQHp/HMCBr/I/3PLIP+jhYcApJaVAObtuP9HlB8AMYQM/zCSqPs0gcL7d+zLArF0MPyjpD0DKoZQ8iEEbQPHqREBOG0i+sTq2P56AVD+pnGq9L1UbQYI7kUAhu9M+"]},"lstm_1":{"weights":["tW8MP0C+C741gxo/Fj8iwBBT4T/TiAtA5s24P3J9yL9u85c+irlgPgLGjb7k6TU/IpePPn8FHL9rlEO+Kqe6v5z6Tz9LtgY/yeyav7vinj2N8GS/I8GKPhJ9v7zOlGE+EnNdPoIpYrwAXbI+K7kCP4BEuD3g8IC/Lr4NP6ntRz3wt/o9OaQXP1PYHb8Au5A/kFijv/Kw1L88jkA/snsRvzu7kL+fVD2+O3LTvwdsyT5iNDVA9issv3UHrT3SBdO+MoIdQCtLDz/o5x6/ccB6PmueCL9o5FK/F8PzvaJe273chx2/1QCsv8Vtu7+lqLI/b+Xvv0SQfTxdqrI+CF0qPx5/J7/3cnG/8OkePniYAb80/Ko9i3HgvjnQ1L48D3I/hAFcQEYN479qMN0/wfl+P1HMBr+3L18/JttqvyogR8DBtCg/bZgdQJnbiL+7Pr4/G//Pv3HE9L/MwjdAaFIHQDlf/T/8ex4/QMz3v3rXET8dx9W/UJWhPgx2qj9sOSK/nz8bwMbL2jzNHUg/7/yvP4AGFEAdmZE/3m0SQDZhCUB4lcI/6miTP5MSlj/2eh5AnOyKvivH5L+A0UW+i8plwIf6BMA8ERG+9+o/P3pVdr+/m+S/SXGQv7nFKj+B0So/C1eLP/uTKkDbkzw/Ej+WP22VJ77V+Ki+sCGoPoeQmD5NPOI+tEZMvrlERb9rR2C+mfxavsIVzD3txSY9q9pkviCthT2vD0c+vegCP/b7sr+iF86/ddPaPVBKNL/3qdw/cXxhv1pEIkDa3G4/UYTmvhBSDL88YirAYIbOPrHc7L8H84Y/3iPGvaarIz+9Rmu94Q1bvoMDA0B5ZlY/IjoYv7Yduz++pqG+Nj2puqPx1r3zE9Q+kys4v/Hdyj6ZFnq91RcZP4Vyxb3Rwxi/WZxpvhrglz6oZRvAUQ0tv3wP8b4X8Ce/qrsYP4qDmz3+s9S/CmxNP5QHdb1wdtQ+q78UvrrKAMEMTirA9qPgP1ZW+j7gzjlAIP+Fuxlm+r0uO7K/","ROLFv+GtVsBuplk91mtmwFDk4L4iKrI+wlUiP13ou74IDZ2++VYpPrg0i74gsBe/Ci+Cvr2vpL5+mo++AW/APoqzPT7uQw0/PpFVv69yi78uOkU/lEJuwHGUDcD0m4/AcQ+4PUHhSr98XIu+6EMnQApSbz+yoSBA7pHdPexkrr88GwC/Z5OXvnxi1L/53IK+apoZPqqj+b7MFX++/3y7vx9t1L+e3qq8pjo1PtUchL2cqK8+WvqJP7ZEJz54cwc8uJFiP59n0L0ZfZe9ILfFvtEHED5RZ6G/ybbpPmv2s76aBOy90MZ+PmR4Ab4mXA0/rEF5vSKUpD8b/Q9AOvUwP7/J+b0U8bI/8++MvlMzQj9Srp8/Qpn8Pk2+hT+xGgu+J8lZwLXpU7/n/X6/rEUIQLS9FD8YHCo/g6FZvzpuCT+uTam+xMiMv2Xopj66lBU/1O//vM9Ufj7c+Wo+8q4qPsh5bj5upxE/7Gv4PlQqpT+o+VY/I1ceQCGG8z/G5yvAJyiqP14Gej/ihQZAnElDPwFO1b+ajzPAhp6RPseaRr4ye4S/ZnYoPxyMUL1p3hQ/E1ZPvtTGAz6Pzu4/WTNiv/LpCD9E9DK8kTy7vkkC0z7tho6+AjSKPq7Iq774wt0/SNRiv9uoGT513k090P1zP1yHI74m1Q8+E2Q2PlJAGr6mYwo/cFSkPmAOtj5tWZi+"],"recurrent_weights":["h7fFv9KfBj8lRJu/N5TeP/z/s74H4hu+HppuP7i9Jr8wi42/3xI1QL97NL7GyQlAL/kTQKVxGsBJEy9A9sqSvlrvob8xIrE/nGRzv8HtisD11Ii/BY8KwN3IO70QEAI/e+exvxA2FkBz+SZAgpv4vzI79j5TFQ0/VoYPPjL4ZL+sRQPA7NyUvqnOBkBe5u6+moWSwFTCf76umSRAvtI+wGql0z+Chtm+ElNiQAqrc8ACEyHA56QJQHAYNUA4QQLArJh9QLRPwr/Rbp+/w2OZv3FS4r0KByW/DQWqP8toGD5S9/0+M2tkvkxVAsCecsQ+zIo0wL3L2j8C2c++FDffPghbjj/hkeI/BrDJv2KA8T6RfSM/6AlKvzEAOUDthiXAOixLwWR22b2dlu4/jDYEwKCeRb+08EjAaatawEYZ6r9LPVU/v71fQM5RxL84vGHAEO1vvphrpb9hVgO/TiUpPzUltD5EInI+ZIwIvrqLtz4MdIc+iaPCvT5kS8DRC1zAFvJjQH833r/uo1G/YNLOwJkiUDvqg4O/OcsQwPCxSj0IOFK+1aXCv8gqsD+1XkrAcnGqv9vrOj/aCBLAnXQmQLC1Cz1L4wpA4gsqwLz/RT/KoIW9fdZ/P7X9WMDaQVu/0IpqvvuTM0AeSD6/o/CvP63erj9i7Dy/GWCKP09yHkDT96k/0DBUv2QLkz+KDJS+l8V7QGo6I79JzjLA2ig8P9Sxu7+QFv0/DXqAwGneaj+oLQdAVLMsQFg8XT/YmgO+RK82QJnHEcCRWGO9FbG6Pa/ioz5EXCA/uhZOv7afKL8DeJC/pB21vxndLr8//zM/aaaVvzQTkT95IVpAonINQMbTRz9OJeK+x6ywPpR27L68cSs/kEPIP1ykcb4321JAscInQN6bZb/2ELO/S3GDP7Nqk781hw1ATbqiv1H42z/ofO0/14kFvwAl/D9YUX0/UZQwP2LCUT8entQ/wM3Gv6hhij8UJ6c/NyrNP5PXpz912hxAivfBPbx3Xj6IaQHA","59zvPSagb7/j5Gg/cbMZvwKb5D/nizU+3/i8P/vJzb54GfC/V/q7v3o7ST4WNSu+4DUYwJLj9z6ahuM+CpRfP/OZyj/D3bS/blsVP8flDcAExs+/4CgPP5DXF0DChsU/SCeiPxoDWMD23aU/g+X/vcyToL82qnHAz5v+vwNHaMA+hIm/dwrhvwTo/T84KoY/fIFAQD7Nh7+QCyTAL0Hgvps8S8BfRI8+/ecEvzsjsr6chxg9WakGwDUbfD/FQ4g/9JWovWRZx77eUVa+AyyMPxpUr7+Eg5w/ng3pPT9WsL7VDgzAo2qgv0PlmD9/DU2/AQULwFBUmz6XzpA+DEjJv9C5W79ozfu/XJzpvmR0wj1AXQ2/4h/6vVUuwj/BEPo/4D0uPXHB1r5USZk/NAGov/smzD9ezHa+TyTCPVJnDr4kfI0+dDqVPh26ND9sVFzAF85SPzCjZj/1jWc+DURnPy2jQL8cF56+9srWv4a0jr8Ws5m/UonNvg/bWD6ajku+Uu6MwFBpfL9+31dAdQ3rP/HHlr5V8kg/I1VUwJd85j/W+xo/A+yQQMnuCMC/gphAAUCMwKeYc7+8DxI/JgFhQApdQj8FIIq/b7dKwDb6b0AHOzi+/YBTQBg6T0ADS7I+DW1HQBl+P8DyIc2/G7CSvwY2m7/r8z9ANgMxPkz6Yz+P+pC/I6ZDQJ3XCUBXOya/"],"bias":["9hWNQOrZAkDSIf29ppN2QLl3zj9KMZ8/IXmkP4MQVEBVT3BAQMwHvEHYDL8dN8w/pznAP745mr6TNxk/WcXnP9NLNUASnZA/hZbUv9qVrL/n5Re+yTvNPrDVOz4ic6q7PUqBPz/hF78MQf0+Z4HCP1JPAkDttiW/68VQQA3rpj8BQo4/z7ifP5gha75m0oFA"]},"lstm_2":{"weights":["Orm3P8KkDT+ppfM+7y1Mv1IVV78bmA6+G2j8vmV6Tz7O64s/b6Suv2tgSL9WmwnAd+AFQMcQJj+vKPY+bSZgvuuBsj+e5+k/XCm8vr5hZEBOPdI+73giPS/aFT+D64a+kWb+v2UED8BM0W8/mJp2Pw8MQT8W9GA/2XlJP/k3gL/VDZq/kPGvP+2rxD+sCY8/tIZUP+SK6j2xPTG/TYndvlZ6KD86oqM+/0AIPYrFtr94O76+DNstP9Q3Zr8wcwc/P20EP/Q3Bj3InFC/3exHP04J8T9Khsc/uw2TPdg2LL1zBI+90UpkPk4xxb4DUY+/Cm4Av6Ib+L7xW289D0wwvxsLx77V3dk+PRddQFkPlL+eeJu/9aIPv/0kUD+cCuw/fQoMv3VPVT8FDXBA8MWHv6gopr+uZMW+DWzxvpDPzr+VUlC/j+FNQGfNWz8usfK/ywLKv+Hby77KYNW/FDUhv55ekT8cOsW/lDL0QLI45T8uimk+mrB6PrDejMAzBJq+3RS1PpuErkDQHRE/k6VWv9MzOb8RjmQ/ESRlwIdDJEB6KRhAwFDiP/7Ysr9R0cK/oFO9v31Wgr89Mqg/VLL3vcP1tj9S1WO9qAZcPYUMTL4KvPM/SqoawOeqMkAXSSs/WHMZP3NeE7+5DVo+0XUawJ1qfj4WYQq+dEzjvjam3j/ECFO+XwI9v9iyw79dxLG+OiGkPxd72z29pQc+FQwVPnAX4z5qgeA/XaxQQGOucT9wo9A+wMiIPh8coT1o0EFAG6VAPy+cVr+UOYY8WkgNPyFWTT8LBbg+r3n8PdwaND13iK0+AZWePRU0/z9NPnK+07MyP6drGz7IgJG/NUSqvzSnBb/MrC9AGo5/wOlcgz9AsZq+IGiJv7PwHb/CJsg+Q9l6Py20Q7838bm+TBmEvsV+lL821T0/IDSOP/jXjT/Ppem8LEIRQKeUnL/R1w9AE8S5vi1PH75VWMS/PfcCQKBfBb9kZwo/UM5sPhC3v70hXCw//FWsvSM6qj8/f8S+","C8GYv094jT/7RE2+UsLWvfSC5D6ci14/mAoEwFRGXb3777++lZM8viDZ5D9fGYQ/8SuCv6BC0L/76TY+FX06P+U38j7GESK/ydroPqn0rb5kRxi/AtymPeEbRT5ucWO+sd1UP6xUGT/INU8/Iz6DP0+7dED4y8w+LKvjvsG7DD/8ny4+D3Mpv8Lcsr9tcKa/kLMgwHn+Ez+5GcK/pFHdvrdvM77cXBhAZG/ePyzYvz+KoDS/4XwrvxRQbT+hrLi/1BM8vaX3iD+O7gS+RRyrvzyeL76N3C+/IduxvsH3AT5IkZ2/8OEnv6aeOz/GybQ9NU5yv1BhFT9bPNG++ShCPre3mb6d8U09rayivhifSj/QjxU/UCZEv+gMU786xag+83d2vmRdnz4B3Ey+sMILwChJkb9tYpw/K2XFPml4iL+5Z209gjF7Pq/P9b6UDN8+MIEGPprBoz89KLM+1b8oPrrBfD5Bno6+mhnkviUsD76vKEq/h8CSv/Q/x75jwkW/FXo9QGIFoj+9iBO/4flpP3n1Dj93AWY8y5sZP2E2sb31HOo/Oy8GP7S3c0A2pxDAZdgMQLqQZz1eAoS/dziaP3JE1T8SULE/IoMlQI8SSEByJB2/B/n8v24UsT4KicU/Lc4DQBhJlz+4gVW/QsWTP5UotL8dlkVAZegWv/yvgj8R5KY/ssSYP8/H3r8NMvo+"],"recurrent_weights":["T3dXvmXjPj+O8BFA+4v2v0WOyj7RVmPAQYLtvMsgor9KezbA/HhIwNeOVsCELWI/1V4SQASiVb+3mxQ9EZBBv4pR4MAQTv7ASWsqP9nyqMDsbBW/xYU8wHn5l8Cz5D7A/BnTP0sMGUH4Yz0/y7X8vpvOCr7Q5yy/BT36vx1noD7C01G+kRNIPzslwT/LEQzAs0MYwK9ERD9ZAoPA/UP/vwWFv7+GAfG+Z85Qv/M5pD+1rXe/BfCIwHLmEsAA2YQ/k/QWP8kiKD+d5IE/RAmcv1iZI8D74LTAPkkAQKKPOT8fw7K+Nl7CvJVDKz8hWPE+5vSrvrT+2z/PO3Y/NLfUP/Q/Fz9nUtE/L/tvPzXQmb/QjXU+4GgKPlzTD8AgxETAm8ouwNdbhsC6QxxAn6Cgvc9AI8C8JhBADXGYPm2AHsAveay/pwYPQIO6AcDkwk679TvkP8YNB0B13/U/+/zDP4MEKz+/xwZAP1kFQCfYkb8HsljAKsgHwGKT5cD0sQpAOtQGP9LZRkH+sD2/y2AeQPh0+D3SwvS+bF5AP7JZgr/lMwTANd9MP4SRWj+icKxAqaXVQDJwwj7iPyRBuv1kv1vjGUCV7zW/GplqPQsSWr93JKi/E4s7vuRoKD+it/+91TH2v/wAhL8H8/i+3tiOP4lCEMDGzuG/0I78v1CwMMF6dbs+wJhbv5hOv75MBYY/0NiwvYj+Hz/T/Yy+2jN6P/YLkL7oZ18/UPdVQAtjsT/kNrg/YrEOPxT8I78dP4O+2wQBQMNQSsBWeIVA5Nmdvw/psD/837y+TH3yPiqXpL6hcUy+3XqOPiMODD/wZZU+mvaYPwv7CD9bMSE/SWvnPvURx78TFiXAnzyqwHa/zL/xdZw/q9psP0UMrz+EogM/OpalPh86Q7+4nbo+wmyHPq9Oab6sl1I/SfU1QLUy6z+ZOvm+9pP7vPJuh7+DZ4K/jkETP4mBjcC3Q7RA5ATdv1QBCb8dYLO/wG6RP5QJvb/O+1/AawQDQKDbUcD7zsY/","2kTzP7SlBL8c9vO/7gxFQMW0ccAug3c/W6KQv73kJEDdo/a+32eTPkfAm8BpOjzA+dCRP+6eQD9FMLQ/f01kQK0aRT/erYZALpqCQN7+gUCWv89A+/2UQNBzVUCqIDK/5Z02QKpFTz+W90fA2rkvwPP4EMAwKZ49KDkSvgAVb7/uGKe/0+2UQAtpL7+bMUC/IuYRvqVSKL9QVV8/HEPwP2rwksAg796/yRK/v8quqj8wsdG+h3nwvtXVWUD0fDS/uHCmviE+MT/C+StAhxH6PWA5Iz+Cfuw/S+QqQGmtrz/ASZy/nKvzP+2Yq77nZ7+/NKoCQJtMD0BPepc/pP28vkd9H8Cic54/DyaZPuDVVkAS+q+/hhSXv7PkMkBhNP+/Vf6oP19gNj/ES4a+Pw2VwNuTVj+Rr6fAEjOUv2fzKD8M876/LI4evwAWIb8EqxY+66AqQBGhrz6aw6E/SRCfvhW8WL/Kdp2+WS6PwCseMkA2OAk/wfurP4c4uD8ksSw/f8PbwHECHD9ZGirAIeUqwMq1aj7QPsO9WrZjvxUFNz9tgBDAsB6+P/SA0b8X5ba+AN+xPuLYxj51hqG/ndRawNfMmMA7S1q+EnF9Pul/sr8HdJ8+LLlBv4CFSMCQEi8+FuZWP1HqqL+1bh7AAGRmP/aKbD+zARDAnRNCQCv2fb84QQdAJObov3ioAD5bnEq/"],"bias":["IwCrv93eyz+dSS++HOwNwLfitz8o9Ym/FW+5v8ryMz83Xti+fu+Qv/dx6z9Hbz3AlRUSPr0Ulj8rIAm+ycUjv4YasD5ml7c/EoGCPwc5oL8ehLu/DXRVvn/xDL49LRu/UctQvzJzEb4QRJo+/3rhvkrM6D3uuHc/tbMzv3XtTj8+yM0+wX+kvlsQ0z//iTE+"]},"dense":{"weights":["w42NPobu3zsyYoa+sxe5P0jWL78T0Is+sFn/vvuzmz73xWQ9c1iXPdsqFL8pw1I/gjTLPu6rCD5+doY/27Ivv2GiQr8i0aa+v1/mvlzvgD6eqk0+ybFYP08aRL5t5e+9ZdteP72Vaz9vtqK+J6qNvmkNhj4QuXG+WAcevhnP5L5dcwG/JBkTv+owEL8wBMO953CxPvv1br06Nos/BUkev6kWmz/GCJE+BW0OQEhQBT5ztLk9yxIKvrRdzz2PVTU+wbr7PbRphr6zKQU+8Hx3Poh/Qz+BKNE92Xm6PlzaGD86Gqy/oFSRvtUPjL4AOwG+c1PAPqz8SL5pAbm+"],"bias":["s1IYu546Oz7wAgc+QIyZPlJYjz4oZxs/Kem9Pg=="]}},"hash":"eb2438cca1b497ffe5416d4dce9407b9b16f06f8f2f7e17d0afb95551a209b6f"}