{"architecture":{"class_name":"Functional","config":{"name":"model","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,3,3,4],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.5,"noise_shape":null,"seed":null},"name":"dropout","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"reshape","trainable":true,"dtype":"float32","target_shape":[-1,12]},"name":"reshape","inbound_nodes":[[["dropout",0,0,{}]]]},{"class_name":"Permute","config":{"name":"permute","trainable":true,"dtype":"float32","dims":[2,1]},"name":"permute","inbound_nodes":[[["reshape",0,0,{}]]]},{"class_name":"LSTM","config":{"name":"lstm","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":7,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":4},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":5},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":6},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2},"name":"lstm","inbound_nodes":[[["permute",0,0,{}]]]},{"class_name":"LSTM","config":{"name":"lstm_1","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":7,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":9},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":10},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":11},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2},"name":"lstm_1","inbound_nodes":[[["lstm",0,0,{}]]]},{"class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":7,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"shared_object_id":14},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"shared_object_id":15},"bias_initializer":{"class_name":"Zeros","config":{},"shared_object_id":16},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2},"name":"lstm_2","inbound_nodes":[[["lstm_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":7,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["lstm_2",0,0,{}]]]},{"class_name":"Permute","config":{"name":"permute_1","trainable":true,"dtype":"float32","dims":[2,1]},"name":"permute_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Reshape","config":{"name":"reshape_1","trainable":true,"dtype":"float32","target_shape":[-1,3,4]},"name":"reshape_1","inbound_nodes":[[["permute_1",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["reshape_1",0,0]]},"keras_version":"2.10.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[3,3,4]],"output_shapes":[[7,3,4]],"tests":[{"inputs":[{"shape":[3,3,4],"values":["UzsxvFMtxr68eMq/r6+mPvKEgL+pkQW/Oq5gPs6Ljz/aMB+/RE0YP3Rurb5wtKY+YWk/P60R2T0QTbY+M1KFvxOY8z+nNAo/NwShv5Y5CMARU+8+rRZ+P5oz0L9fOZG/33Snv8aLAT/0pBu7mAKrvjsLwr+0S1A/2K4TvyTIvr/21E3A8y9oP8kJWT732zJA"]}],"outputs":[{"shape":[7,3,4],"values":["fKeovNxA97yxMQ++DI8wvrGEor01LTw/oyavvVryDD5FZh6+DO3uvIYOSb/iDaK9opJ3PwCaRDokw1k9eH60vHybPj01jD8/EphWPhDJOry0xki9JkSPvpjD9z6Is9k8YJtzP4Cu4zt4KTW96M4dvUBxhjtmgkk/TaiIPuCBNbymHfM9/eyTvj3rDD8Ap7076t5BPzgVoL4Tq+C+9t6OPTYxrD4VXU49IAf9Po3N4j0OdCC/tn2jvoZmIz4WUxW9Ln46P86lpj7vfSU/ny3uPRCllr6AcPy6BoOvPgzwlj3qYOM+OuivvnKFeD4gVDe97IdwP+icPD0gttc+0HcqPUT8lT2/cAI/SOUVvwZh4T31V7S+cZK0PmFqlT4uD/I+ViBwP1IgAL62Aj6+gMkWvdjTzL3s8wI/klIYv2Ah+DyIXHA9jkPhPidK0z4R8to+"]}]}],"trainable_params":{"lstm":{"weights":["xUQSvquk+L+eKSi+WHpwv8HC5b2CE4c9e3uHvo69dr2sXv4+jCYzPgjmlz7PwwFAKqcMwHp3Xj8MxZE9npycvjEggLsrHTs+jg2kvdualTwYKJk+cmfnQNVZRDxEzgi/OtECPij5TECJ3dc+xKyfPpesWr7+ulw/T04PPqGC278Oq8s8g7eLvuUz0D6zbjFABhIEQP+fmz1Kb7S/w3CTP8QNHL8V0XG/mn1FPwtEfL2shiC9YxU9wDeSLjxxEyC9LvjJPpPBD75W+h2+PoubvlIdt78xYxU+bDu/vuHdWUCxCAs/22/EPilpVz3nMJ4/CuUbvZZMM777/MVAQL8hv3cjgr7sOd4/dI3vvRxrEj87iIg+U7SXPwxqpb0wAA29dB1jvkuYXL5ErTQ9I1rFPpBLrz5AEHRAHwOuPhmzv76LYH7ACHrfPunrJz7B0Pw+"],"recurrent_weights":["U3pHP8tqrT4QMpe/TS9ov7Z1AcC6NiE/OHzGP+GsUL/28aW/hGmUvmEAwb/Mb6i/u0yXP62ISz9ecYG+RiqKvjOwSz8MoAG+mJg6v8xwYL9OcU4/c92CPiTsar6B7AS9L7PAP5gwh74pHr0/bFACwG3TbsDDWPI/1U2svxyYnb8JKXS+C7QOwDr+kL4CviU/s1v1vib7hD4g2OE+YzOUP135RT/WW/8/kRqEP+XRbj8WBRS95Ue4v7oLKz+Y8JhAeVvVPhUd5r9tl8C/fUA2wMz2DL+JLOe+5r6jv5jUoL7Zic2/9r2Bv1p6VD0tvta/cI95v7Ao6b3zXCTASsf3PQh4TT4Jb9s+eiWXPzAutj/V5XK/88icPwG1jL7URmI+OdnVvfbOuL+rlz0/YLMnQNStQj7Ojo6/0uekv1yHLr4vAv6/ajoevY1Gkj+NfZw+SP8+vy1jkL7CIac/TeygP6BTbEDnQ6Y/oTBoPwKB6r554sU/GucVv9lZEz8qKSS9EbNzvylbFT+dmUQ+9kumvZ7pKr/47rk/vXxxvvyNx7/rv3E9DG6hPzLeUT9XIopAyQzkPUzkpD7kvCa+7rLsvtgBmT/YFyw/FkROP2kWgL8Ajsc/kAf2PukVIkBManS9Ot8VwBFapz/7x8C/L8qKv5Dan74Loiy/K1pxP5AKScCZeOi/7A9lP8pG174vF8S+iCUhv+rMQL/niAtAVUFvPhJqGz9ce7A/tOmZv5bX5T+LgSA+Oe2vP1x8/D8qf4I/Jm1aP5y8b7/jEvs+MIOIP83JkL+Rqa8/ktfdv/3Jsz94Y48+F0m9v++2uj9r6zPAy2bNv06Tpj9rvRw/yygNvgpUZb9ZA4a/jzo1QB1XaL/sR/U/S63SP3YQu78WIwe/UMOGP/SNOr7XFz1AxaV+P0x4iT+K490+IwsHQCynHD3Zjf8/jHa2v7Irmb9Ukpg/14KCv17us758Snm+JdCcwMZum78lRwRAgkFAP2BFjj/1Di2/EcH0Po1NOD87uqI+","ZXDUvuNTwj8oZFy+87zBPw=="],"bias":["Euw2PbCOk74wuse7Fp9avxAqiz/naSBAH5IhQFHjhT9JfRVAREh5PwciB0DG79I+MsC4vlvDlj9ROAQ/Gn+cPULm9L2W8cM+B5ZUPzfBxz//Mmc/zHA0Px2Tlj6y0Ww92uM2P/uNtT+P4jxARBxgPw=="]},"lstm_1":{"weights":["49XgvsK4Lb/QMY2/av7sv+5/aL8hLiI/O+Nrv5HbCsAaoiE/Jkr0vwh8F7+iyZU+6xfcvTb2Zj+b/EU+4heRP1LXlT/CAN6+mlq0P+42sr/rfUK+hT2tPwy8VL8Z+G8+IwxsP1hPI7/Zwq6/+1rAv6y+PMC4rji/I3Wmv6YEGL3SBq++wva8vgltK7/c2dk97G+yPgiUGb9v9To/yQOAvzHQyb6DNNU+qO0dP/5q077I3Ke+ZDypPbTfCsDVTq4/HHACPy1qwj79Xi6/4TzoPLNcCT7xVj4/9rbNPsvb5L4AbzvAwPAVvxLdLr+gdyjAg0QJwKlR9r9Ne5e/dxN1P4FNd78AMJG+zObOv4SXPb9un2JAbvbyvQcGYj/ehiC/hbdlPmWuq75dg5G+SFkGPzXeW7+lIC4+UQKxPibl3L87vCC/TdnYP0HRuz5Madu+12EXP89tYz4DuZy/dXYFvgUoaz+dca4+Ktk3Pk6FOr7ILJc/cgQavz8lAT/4GS+/objsvtFbrD7qUBu/ylraPvoh/j/0pe4+1OMBQF6nqr8GWMy/aLqxvRmTir/7nDk/SmwqvqA9c7+nVGY/PRU/QNlcB0AP18a/j+1mvlwvjz4CUIi9OGTkPypK978JIgu/kFOTvrGafr4xkRE/Lo5GP5IbyL+hdJe+Zr0DPq1Ri75XJ3C/51LYvnIwXj8VcQS9OO/hPsgspL7y3vw/C3muPwZniz9zyis/6DIbv0SRpr8ZmxQ/lIeTv1rIDz566MU+zhEzQNg0Vj8dLyg/JP+DPpv9MkDv97A/lG8BP8uL577N+/i+WPtlQNBzpb101me/3IGfvwp5qL+h9/W/g7yOPiqx2j+I6fc+4vVUP/kJrj4zB3Y/4xfIP3BTi74lsyvAVNLbPLbFib/wch5AsjuBvMwefT+RIPU/zRCxP3uyzb0NTFS/yFAsv9AD6j5kt6O+0KsUvx5p5D8TGrg/JchGPk1E3b6nUvQ+eR9Sv4/9gL6RYoe/XP9Qv+rnlUCGCJg9","cM6vvs23H78pPcA/q3ecvw=="],"recurrent_weights":["DrTfPxPg/by4e2C/J0yKP3o6SUBuvL2+vU+UP6yThj64jQa/+K2wvKTQuj/ywPO+bvgbwMdWbL2gVBK/9WigP8CXc71kcQrAwq8APw4a2T4LfpA/2aCTPgu8Ub+iJem/qXwuv1rSeL/0pBi/ZD+uP/s5eL3uc209Iw4xPwB8ib/zqUbAdmWHP9hJHUAeeZE/BxiMv3nRPcC/J1i/FF4cQN36oT/CyOK+G6iXv68Dcr+qm9K/lbFjP7lPX78hspu/0OrrPj75B8CCLmE/cfEgwF/bdD8nx5g+q4OUP7sPNECoH4O/GzPSP4yhIUDcQJa/0Osjvztb4b/iJBhANNaZPxFRhr7OK0Y/zCCwP7pSKb1CYdC/Zi1MviPU9D+pZMi+/e0wP8s2J7/llAe8FL0avfMdsL+t1B+9gSNyP3n+qb+aqiQ/VP9APhDLiT9w5Ho+ocfPv+WyPr/P16s/LaeCvxa8776c7W0+LYqgP63Lr71SCVNAYczjvSsmPT9HFIW/BnWpvHvWzb/g70k/9QRHvR+IJD+q6Vs/rVWPv78pRr2argo++UXEPz8MDz9V0p2//iQJvoV8pr/spbk/GJvFv3Aqlb8SBaQ/nzqzPoMZuj+isI89p4kNv2shCL/LxvS+4lyivrdJlz5oBUc/Rh3PP50dJz/YehO+sPxQP4GiB7/ZTeU9eEbMvwwxzb8UuIs/3JPxPmvXaL8pa5g/bO0CQL/oNUACbDBAU3hEv3U96z+AdSw+zQjCv+flub46GR2+r3pJv8sqFj/hrck8hEKxvi/3yL2L8s6+bbAdv8g8zj8oU0A+GJvhvbhVJT/08lQ/CDWhv6pEkD6m2wC/l3vZvTFIrz8Bfr6/bqH4vmDKWT5VgI4+OoAJwN8Ltb5Bv78/wZuaPTwX8b/sv5O/fkiIv5K5zD6AtLO/k4EPwKvhCD5N3BxAf+f1vzX2p7/j7AQ/Ugu9P8Dpnj7mW3m/3m2xPytfzr8iD/4+AdiQP1UPjb8GwDE+cbNDv7kvD79+kQS/","JCq7vjUyEcCzDUy+v9+oPw=="],"bias":["97esvVZauT3Il2s/7IYvPmOJMUBDRxE+AHbzP2MSgj/TkZQ++yd7P5/AKD8CpWo/sR6BPyAWXD5yp8Q+JPYAvMe06r5RfLu9B3yKv8N01b7PxBw/yVW+Pz75yD/nKpQ/ttOCP6Zozz9NsnE/Azsdvw=="]},"lstm_2":{"weights":["CVcEwJyKqD4igic+SxpxP/sMH8CXWx+/6DljvhuNg77wP6s+svjbv735ED3I+8G+iDxbvrJSfb0Qygu/EpbBPfcLeD+HuR6/hm9BPYsRlz5r7HU/cU7APkyw/j/HH769AAk0P8Zxp78hyYi+oAktv9iDAz5of+g+MJUJv3Twz77+qW2+le6nvzUE873GDM0/LwTbP1oYBUBQaha7Gp9Mv3hEEMB1BSc/GHy9vsuqjz6kyXI/l/dcP6rPGb1OUak+8xkNPuQucr8hEJk+Bidkvi0mw7/3fmC/6Y8XP+7PM7+PCuI+RfUIP1K8Uj8Xx+q951VeP41U0z68y5E+Zl0Dv2ya3T4EUOa/XDkbv25obb+5nlS/wSIrvnY29r6osk6/VlUIP9bUJT3FDhA+aqndPvgW/L4zx1S+DivavVtfib87euy+oASlvjrLsb9iHNw+BiJZv5ufiL3NS92+aLJWP3OUL8A6g+2/6GVSv2OMob5ZKky+EpQjP3WVij5tT4I/x71Lvx5WnL4eoV2/VgYDv7BohL/rU3W/8xxbPvIYDD/3t8i9Pi3Iv1AQNj9eOPy+SGutvVn7rr+DVEc/5JYfPrSrK0AbRzG/rnffPhGgZr0iEpE/Kb6/P9rQrzsGoJe/mwzOv0ZA2z3tqQY/kxwJQGFbnT+iXPc+M6rEvhrAAb90Pcy/JqxEP8LLpb4sSY+/eF6fv0PAH794jWE+AEnZvbj5y7/JlOA/cnaYPxAetr8wCYC/wN6xvwRyDcAjOMs/DNkGv/pvgr4r2a6+9Zx9PDXyR0AyPCi+salhv03aCz+85Py+9wmoPv+eDb+pWBw+JZbVP3RAbTzx0LO+0uy7vurITj//U1o//2sOQOHoxb5KTIa/Ovksv5qExz6ARO2/DtvhPzf3mT+ASeo9dbwuP6+X5j8/udg+Wy+RP3LViT+OtNA/QkgDv8fz/j+8EUi+fu0tP+IBJL4gdpo+cbZEP0zwAT/oV7+/4kVqvbFt6L97O4A+O0eIPpSPTD/TQbY/","NHUNP/wVqT/3LFg+BjNMQA=="],"recurrent_weights":["wU3XPzNtuD6sOEM/4/qpPE0iG8DfdC++uVGuP0Yogb+mJik/bfupP8f6M8D4ipY/doZRP8sxg7+aHg6/M1c5P1+yur7MczDASbdKPxgNfD9JmiK+lU2Wv0WNhL8E8zq+Z6yyP14Oor8XgMa+8BnoP9WH3z8R4f0/3rDSP+udj76Caxm/gZCIPpKdEz9KoLQ+j2DuP+3ezT/1ao6/1eazv/zlJMDV3wrAO22rv6psir8CAM6/TnuJvwJh1z4TWki+EpVEv+Vo1r8vAbU+IpGLPXX4TcAU3W6/dJ9kPx9ZKz9d46w/t0CKv3kAab9mKbE/OA1EQEdPIT8jpp8/MQSGvUtIBj+YxC0/nk/HP3aHHsDl/0K/ssv6vmobjL6KPpS/OH1+v2Ntab9w3PS+XM05v842WjxUX+e+lVbxPu/Nhj6GjO89iZBvPwyZlT70kUe//0aLv/218D8Ul0S/E3XiPZrvb7/iNTm/E/z0PrmjS77p79i87y/Ev+s4Jr9n8vG/jyZbP5599T+Wbro/tB4uPl1nuj+Jnw3A4exWvgZEGr/FbUxA7HxVP+uBHEDiqAW/ehjgv4yr/78L0sU/4m0wQC1ykD8sw/E/I/63QN/oTr9x24A+ogs4v8Wlob94vrY/DLZtvoJsCMAwW7q/L76AP/aLfD6C2MK/oje9vmSYRT/LKZM/su/vPtQ2hr+t+5y/jWWOvk9EBkDCvHM9IKObP2usI8A4tck+AHkyPzhU67/E/3o/PSWYPyujCcDE3sy+Ap05vyKNOcBRDl6/XxROPnS7B8BgaE/A/0uXvt3qSz2loIO+2xrovb6K6r8bf64/gTWOP3kh3z5++Ky+zJkQwIxDhb96XxpAdDU2vqDKmD4dX6I/wGNYP3WA7z7YVBe9/KyqvlLTiz5h7am/mgj1Palu/D7QFD88R45CQMaAIr8FnCe/k541vzqQlD+l5Vg+jhC1vkcqb7/ttB+/yhcYvrBrF78HM68/A/Cpvqkp/jzQgu6+Rqxfv3rpjL/1UYi/","ZWsZwI6oTj/72Aa945Eovw=="],"bias":["42+ePiD5AT9OPr8/7zC1P2Jxqz813oc9NF/qPh5aqD5stVQ/53uDPlmslj74Eho/YCKjP+CzPD/bBDk+LVUIP8eZAj+faYa+3pcLPz0KyT6GTD4+/7UZP3bNrj/COkY/u217Pyt+bj9L8b8+dGLTPw=="]},"dense":{"weights":["YilKPn1I+j6ot/k+QPd2vhoLqL5z2gA/P8zTPiyMAT+t6oc9GD4avpnMVT+4UvQ+RDlpP0kqCD/cuH8/uAiwPqFI2T4xgIa+ILN1vWOyGT4hm8c+aPBQvh+gPr8sT1G/4v4hv387Rr9APhg+If8OvQuynb6YP4A9DQqDPfOoDbxva2q+mRNLvqzc5b6jRAY/u1ZFvQDrzL10p5I/46UMv+1eKb2GOWc+o4rFvxdagD4m8nk+a9lpPrRGbz6fBsc+LQOjPg=="],"bias":["HZ3UvQWkdz6fHYM+5JjLPBSHYT4PeKk+e+q2Pg=="]}},"hash":"b96e3736b98fd245bc9a82636fca3403ed57b38b6de06e756e5204e33d8774d1"}